renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_sci/src/r_sci_rl.c
    /* Initialize channel control block flags */
    hdl->tx_idle = true;

    if (SCI_CH3 == hdl->channel)
    {
//        R_Config_UART3_Reset( p_cfg->baud_rate );
    }

    return err;
}  /* End of function sci_init_async() */

#endif /* End of SCI_CFG_ASYNC_INCLUDED */


/*****************************************************************************
* Function Name: R_SCI_Send
* Description  : This function is used to start transmitting data. For Async,
*                the data is loaded into a queue and transmission started if
*                not already in progress. For SSPI/Sync, the channel is
*                checked to see if busy, and if not, transmission of the
*                source buffer is started.
*
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    ptr to data to transmit
*                length - 
*                    number of bytes to send
* Return Value : SCI_SUCCESS -
*                    requested number of bytes sent/loaded into tx queue
*                SCI_ERR_NULL_PTR -
*                    hdl or p_src is NULL
*                SCI_ERR_BAD_MODE -
*                    channel mode not currently supported
*                SCI_ERR_INSUFFICIENT_SPACE - 
*                    not enough space in tx queue to store data (Async)
*                SCI_ERR_XCVR_BUSY -
*                    channel currently busy
*                SCI_ERR_INVALID_ARG
*                    length is out of range
******************************************************************************/
sci_err_t R_SCI_Send(sci_hdl_t const hdl, uint8_t SCI_FAR *p_src, uint16_t const length)
{
    sci_err_t err = SCI_SUCCESS;

    /* Check arguments */
#if SCI_CFG_PARAM_CHECKING_ENABLE
    if ((NULL == hdl) || (NULL == p_src))
    {
        return SCI_ERR_NULL_PTR;
    }
    if ((SCI_MODE_OFF == hdl->mode) || (SCI_MODE_MAX <= hdl->mode))
    {
        return SCI_ERR_BAD_MODE;
    }
    if (0 == length)
    {
        return SCI_ERR_INVALID_ARG;
    }
#endif

    if (SCI_MODE_ASYNC == hdl->mode)
    {
#if (SCI_CFG_ASYNC_INCLUDED)
        err = sci_send_async_data(hdl, p_src, length);
#endif
    }

    return err;
} /* End of function R_SCI_Send() */


/*****************************************************************************
* Function Name: sci_send_async_data
* Description  : This function determines if the tx byte queue of the channel
*                referenced by the handle is not full, and call the byte
*                transmission function.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    ptr to data to transmit
*                length -
*                    number of bytes to send and possibly receive
* Return Value : SCI_SUCCESS -
*                    data transfer started
*                SCI_ERR_XCVR_BUSY -
*                    channel currently busy
*                SCI_ERR_INSUFFICIENT_SPACE - 
*                    not enough space in tx queue to store data (Async)
******************************************************************************/
static sci_err_t sci_send_async_data(sci_hdl_t const hdl, uint8_t SCI_FAR *p_src, uint16_t const length)
{
    sci_err_t   err = SCI_SUCCESS;
    uint16_t    cnt;
    byteq_err_t byteq_err = BYTEQ_ERR_QUEUE_FULL;

    if (true != hdl->tx_idle)
    {
        return SCI_ERR_XCVR_BUSY;
    }

    /* Determine amount of space left in tx queue */
    R_BYTEQ_Unused(hdl->u_tx_data.que, &cnt);

    if (cnt < length)
    {
        /* If can't fit, return */
        return SCI_ERR_INSUFFICIENT_SPACE;
    }

    /* Else load bytes into tx queue for transmission */
    /* WAIT_LOOP */
    for (cnt = 0; cnt < length; cnt++)
    {
        R_BSP_InterruptsDisable();      //RYZ014
        byteq_err = sci_put_byte(hdl, *p_src++);
        R_BSP_InterruptsEnable();      //RYZ014

        if (BYTEQ_SUCCESS != byteq_err)
        {
            /* If the return value is not BYTEQ_SUCCESS. */
            err = SCI_ERR_INSUFFICIENT_SPACE;
            break;
        }
    }

    if (SCI_SUCCESS == err)
    {
        hdl->tx_idle = false;
        sci_transfer(hdl);
    }

    return err;
} /* End of function sci_send_async_data() */

/*****************************************************************************
* Function Name: sci_put_byte
* Description  : Transmits byte if channel is not busy. Otherwise, byte is
*                stored in tx queue until can transmit. If buffer is full
*                and cannot store it, an error code is returned.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                byte -
*                    byte to transmit
* Return Value : Same R_BYTEQ_Put()-
******************************************************************************/
static byteq_err_t sci_put_byte(sci_hdl_t const hdl, uint8_t const byte)
{
    return R_BYTEQ_Put(hdl->u_tx_data.que, byte);
} /* End of function sci_put_byte() */

#if (SCI_CFG_ASYNC_INCLUDED)
/*****************************************************************************
* Function Name: sci_transfer
* Description  : Transfer for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_transfer(sci_hdl_t const hdl)
{
    uint16_t    num;
    uint8_t     byte;

    R_BYTEQ_Used(hdl->u_tx_data.que, &num);
    if (0 >= num)
    {
        hdl->tx_idle = true;    // set flag if queue empty

#if SCI_CFG_TEI_INCLUDED
        sci_cb_args_t arg;
        arg.event = SCI_EVT_TEI;

        if (NULL != hdl->callback)
        {
            arg.hdl = hdl;
            hdl->callback((void *)&arg);
        }
#endif
    }
    else
    {
        /* Get bytes from tx queue */
        (void)R_BYTEQ_Get(hdl->u_tx_data.que, (uint8_t *)&byte);

        /* TDR/FTDR register write access */
        SCI_TDR(byte);
    }
} /* End of function sci_transfer() */

/*****************************************************************************
* Function Name: txi_handler
* Description  : TXI interrupt handler for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void txi_handler(sci_hdl_t const hdl)
{
    sci_transfer(hdl);
} /* End of function txi_handler() */
#endif /* SCI_CFG_ASYNC_INCLUDED */

/*****************************************************************************
* Function Name: R_SCI_Receive
* Description  : Gets data received on an SCI channel referenced by the handle 
*                from rx queue. Function does not block if the requested 
*                number of bytes is not available. If any errors occurred 
*                during reception by hardware, they are handled by the callback 
*                function specified in R_SCI_Open() and no corresponding error 
*                code is provided here.
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
*                p_dst -
*                    ptr to buffer to load data into
*                length - 
*                    number of bytes to read
* Return Value : SCI_SUCCESS -
*                    requested number of byte loaded into p_dst
*                SCI_ERR_NULL_PTR -
*                    hdl or p_dst is NULL
*                SCI_ERR_BAD_MODE -
*                    channel mode not currently supported
*                SCI_ERR_INSUFFICIENT_DATA -
*                    rx queue does not contain requested amount of data (Async)
*                SCI_ERR_XCVR_BUSY -
*                    channel currently busy (Sync)
*                SCI_ERR_INVALID_ARG
*                    length is out of range
******************************************************************************/
sci_err_t R_SCI_Receive(sci_hdl_t const hdl, uint8_t *p_dst, uint16_t const length)
{
    sci_err_t   err = SCI_SUCCESS;

