renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_sci/src/r_sci_rl.c
    /* Check arguments */
#if SCI_CFG_PARAM_CHECKING_ENABLE
    if ((NULL == hdl) || (NULL == p_dst))
    {
        return SCI_ERR_NULL_PTR;
    }
    if ((SCI_MODE_OFF == hdl->mode) || (SCI_MODE_MAX <= hdl->mode))
    {
        return SCI_ERR_BAD_MODE;
    }
    if (0 == length)
    {
        return SCI_ERR_INVALID_ARG;
    }
#endif

    if (SCI_MODE_ASYNC == hdl->mode)
    {
#if (SCI_CFG_ASYNC_INCLUDED)
        if(SCI_CH3 == hdl->channel)
        {
            err = sci_receive_async_data3(hdl, p_dst, length);
        }
        else
        {
            err = sci_receive_async_data(hdl, p_dst, length);
        }
#endif
    }

    return err;
} /* End of function R_SCI_Receive() */

#if (SCI_CFG_ASYNC_INCLUDED)

/*****************************************************************************
* Function Name: sci_receive_async_data
* Description  : This function determines if the rx byte queue of the channel 
*                referenced by the handle, the requested number of bytes 
*                is available, and get the data from the rx byte queue.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_dst -
*                    ptr to buffer to load data into
*                length - 
*                    number of bytes to read
* Return Value : SCI_SUCCESS -
*                    requested number of byte loaded into p_dst
*                SCI_ERR_INSUFFICIENT_DATA -
*                    rx queue does not contain requested amount of data
******************************************************************************/
static sci_err_t sci_receive_async_data(sci_hdl_t const hdl, uint8_t *p_dst, uint16_t const length)
{
    sci_err_t   err = SCI_SUCCESS;
    uint16_t    cnt;
    byteq_err_t byteq_err = BYTEQ_SUCCESS;

    /* CHECK FOR SUFFICIENT DATA IN QUEUE, AND FETCH IF AVAILABLE */
    R_BYTEQ_Used(hdl->u_rx_data.que, &cnt);

    if (cnt < length)
    {
        return SCI_ERR_INSUFFICIENT_DATA;
    }

    /* Get bytes from rx queue */
    /* WAIT_LOOP */
    for (cnt = 0; cnt < length; cnt++)
    {
        /* Disable RXI Interrupt */
        DISABLE_RXI_INT;
        byteq_err = R_BYTEQ_Get(hdl->u_rx_data.que, p_dst++);
        ENABLE_RXI_INT;

        if (BYTEQ_SUCCESS != byteq_err)
        {
            err = SCI_ERR_INSUFFICIENT_DATA;
            break;
        }

        uint16_t byteq_free = 0;
        R_BYTEQ_Unused(hdl->u_rx_data.que, &byteq_free);
        if (SCI_CFG_UART_RX_BUFFER_THRESH < byteq_free)
        {
            switch(hdl->channel)
            {
#if (SCI_CFG_UART0_FLOW_CTRL_ENABLE)
                case 0:
                    SCI_CFG_UART0_RTS_PORT = 0;
                    break;
#endif
#if (SCI_CFG_UART1_FLOW_CTRL_ENABLE)
                case 1:
                    SCI_CFG_UART1_RTS_PORT = 0;
                    break;
#endif
#if (SCI_CFG_UART2_FLOW_CTRL_ENABLE)
                case 2:
                    SCI_CFG_UART2_RTS_PORT = 0;
                    break;
#endif
#ifndef TOMO
#else
#if (SCI_CFG_UART3_FLOW_CTRL_ENABLE)
                case 3:
                    SCI_CFG_UART3_RTS_PORT = 0;
                    break;
#endif
#endif
                default:
                    break;
            }
        }
    }
    return err;
} /* End of function sci_receive_async_data() */

#endif /* SCI_CFG_ASYNC_INCLUDED */

/*****************************************************************************
* Function Name: sci_receive
* Description  : Receive for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_receive(sci_hdl_t const hdl)
{
    sci_cb_args_t   args;
    uint8_t         byte;

    /* Read byte */
    SCI_RDR(&byte);

#if defined(__CCRL__) || defined(__ICCRL78__)
#if (SCI_CFG_UART0_FLOW_CTRL_ENABLE || SCI_CFG_UART1_FLOW_CTRL_ENABLE ||  SCI_CFG_UART2_FLOW_CTRL_ENABLE)
    uint16_t byteq_free = 0;
    R_BYTEQ_Unused(hdl->u_rx_data.que, &byteq_free);
    if (SCI_CFG_UART_RX_BUFFER_THRESH >= byteq_free)
    {
        switch(hdl->channel)
        {
#if (SCI_CFG_UART0_FLOW_CTRL_ENABLE)
            case 0:
                SCI_CFG_UART0_RTS_PORT = 1;
                break;
#endif
#if (SCI_CFG_UART1_FLOW_CTRL_ENABLE)
            case 1:
                SCI_CFG_UART1_RTS_PORT = 1;
                break;
#endif
#if (SCI_CFG_UART2_FLOW_CTRL_ENABLE)
            case 2:
                SCI_CFG_UART2_RTS_PORT = 1;
                break;
#endif
#if (SCI_CFG_UART3_FLOW_CTRL_ENABLE)
            case 3:
                SCI_CFG_UART3_RTS_PORT = 1;
                break;
#endif
            default:
                break;
        }
    }
#endif /* SCI_CFG_UART0_FLOW_CTRL_ENABLE || SCI_CFG_UART1_FLOW_CTRL_ENABLE || SCI_CFG_UART2_FLOW_CTRL_ENABLE || SCI_CFG_UART3_FLOW_CTRL_ENABLE */
#endif /* defined__CCRL__ || defined__ICCRL78__ */

    if (SCI_MODE_ASYNC == hdl->mode)
    {
#if (SCI_CFG_ASYNC_INCLUDED)
        /* Place byte in queue */
        if (R_BYTEQ_Put(hdl->u_rx_data.que, byte) == BYTEQ_SUCCESS)
        {
            args.event = SCI_EVT_RX_CHAR;
        }
        else
        {
            args.event = SCI_EVT_RXBUF_OVFL;
        }

        /* Do callback if available */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = byte;

            /* Casting to void type is valid */
            hdl->callback((void *)&args);
        }
#endif
    }
} /* End of function sci_receive() */

/*****************************************************************************
* Function Name: rxi_handler
* Description  : RXI interrupt handler for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void rxi_handler(sci_hdl_t const hdl)
{
    sci_receive(hdl);
} /* End of function rxi_handler() */

/*****************************************************************************
* Function Name: rxi_handler
* Description  : RXI interrupt handler for SCI
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void rxi_handler3(sci_hdl_t const hdl)
{
#ifndef SCI_RYZ014A
    sci_cb_args_t   args;
    uint8_t         byte;

    /* Read byte */
    byte = RXD3;

#if (SCI_CFG_ASYNC_INCLUDED)
    if (SCI_MODE_ASYNC == hdl->mode)
    {
        /* Place byte in queue */
        if (BYTEQ_SUCCESS == R_BYTEQ_Put(hdl->u_rx_data.que, byte))
        {
            args.event = SCI_EVT_RX_CHAR;
        }
        else
        {
            args.event = SCI_EVT_RXBUF_OVFL;
        }

#if (SCI_CFG_UART3_FLOW_CTRL_ENABLE == 1)
        uint16_t byteq_free;
        R_BYTEQ_Unused(hdl->u_rx_data.que, &byteq_free);
        if (SCI_CFG_UART_RX_BUFFER_THRESH >= byteq_free)
        {
            SCI_CFG_UART3_RTS_PORT = 1;
        }
#endif /* (SCI_CFG_UART3_FLOW_CTRL_ENABLE) */

