renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_sci/src/r_sci_rl.c
        /* Do callback if available */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = byte;

            /* Casting to void type is valid */
            hdl->callback((void *)&args);
        }
    }

#endif /* (SCI_CFG_ASYNC_INCLUDED) */
#else
    sci_receive3(hdl);
#endif
} /* End of function rxi_handler3() */


/*****************************************************************************
* Function Name: sci_error
* Description  : Error for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_error(sci_hdl_t const hdl)
{
    sci_cb_args_t   args;
    uint8_t         byte;
    uint8_t         reg;

    reg = SCI_SSR;
    if (0 != (reg & SCI_RCVR_ERR_MASK))
    {
        if (0 != (reg & SCI_SSR_ORER_MASK))
        {
            args.event = SCI_EVT_OVFL_ERR;
        }
#if (SCI_CFG_ASYNC_INCLUDED)
        else if (0 != (reg & SCI_SSR_PER_MASK))
        {
            args.event = SCI_EVT_PARITY_ERR;
        }
        else if (0 != (reg & SCI_SSR_FER_MASK))
        {
            args.event = SCI_EVT_FRAMING_ERR;
        }
#endif
        else
        {
            /* Do Nothing */
        }

        /* Flush register */
        SCI_RDR(&byte);

        /* Do callback for error */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = byte;

            /* Casting to void* type is valid */
            hdl->callback((void *)&args);
        }
    }

} /* End of function sci_error() */

/*****************************************************************************
* Function Name: eri_handler
* Description  : ERI interrupt handler for SCI UART mode
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void eri_handler(sci_hdl_t const hdl)
{
    sci_error(hdl);
} /* End of function eri_handler() */

/*****************************************************************************
* Function Name: R_SCI_Control
* Description  : This function configures non-standard UART hardware and
*                performs special software operations.
*
* WARNING: Some commands require the transmitter and receiver to be temporarily
*          disabled for the command to execute!
*          PFS and port pins must be configured prior to calling with an
*          SCI_EN_CTS_IN command.
*
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
*                cmd -
*                    command to run
*                p_args -
*                    pointer argument(s) specific to command
* Return Value : SCI_SUCCESS -
*                    Command completed successfully.
*                SCI_ERR_NULL_PTR -
*                    hdl or p_args is NULL
*                SCI_ERR_BAD_MODE -
*                    channel mode not currently supported
*                SCI_ERR_INVALID_ARG -
*                    The cmd value or p_args contains an invalid value.
*                    May be due to mode channel is operating in.
******************************************************************************/
sci_err_t R_SCI_Control(sci_hdl_t const hdl, sci_cmd_t const cmd, void *p_args)
{
    sci_err_t   err = SCI_SUCCESS;
    sci_baud_t  *baud;

    /* Check argument hdl */
#if SCI_CFG_PARAM_CHECKING_ENABLE
    if (NULL == hdl)
    {
        return SCI_ERR_NULL_PTR;
    }

    /* Check argument p_args*/
    if (NULL == p_args)
    {
        if (SCI_CMD_CHANGE_BAUD == cmd)
        {
            return SCI_ERR_NULL_PTR;
        }
    }

    if ((SCI_MODE_OFF == hdl->mode) || (SCI_MODE_MAX <= hdl->mode))
    {
        return SCI_ERR_BAD_MODE;
    }
#endif /* End of SCI_CFG_PARAM_CHECKING_ENABLE */
    
    /* COMMANDS COMMON TO ALL MODES */
    switch (cmd)
    {
        case (SCI_CMD_CHANGE_BAUD):
            /* Casting void* type is valid */
            baud = (sci_baud_t *)p_args;
            if (SCI_CH3 == hdl->channel)
            {
//            	R_Config_UART3_Reset(baud->rate);
            }
            break;
        case (SCI_CMD_EN_CTS_IN):
            err = SCI_ERR_INVALID_ARG;      // RL78 not support.
            break;
        default:
            if (SCI_MODE_ASYNC == hdl->mode)
            {
#if (SCI_CFG_ASYNC_INCLUDED)
                /* ASYNC-SPECIFIC COMMANDS */
                err = sci_async_cmds(hdl, cmd, p_args);
#endif
            }
            break;
    }
    return err;
} /* End of function R_SCI_Control() */

/*****************************************************************************
* Function Name: R_SCI_Close
* Description  : Disables the SCI channel designated by the handle.
*
* WARNING: This will abort any xmt or rcv messages in progress.
* NOTE:    This does not disable the GROUP12 (rcvr err) interrupts.
*
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : SCI_SUCCESS -
*                    channel closed
*                SCI_ERR_NULL_PTR -
*                    hdl was NULL
******************************************************************************/
sci_err_t R_SCI_Close(sci_hdl_t const hdl)
{

#if SCI_CFG_PARAM_CHECKING_ENABLE
    /* Check argument hdl */
    if (NULL == hdl)
    {
        return SCI_ERR_NULL_PTR;
    }
#endif

    /* disable ICU interrupts */
    sci_disable_ints(hdl);

    /* free tx and rx queues */
#if (SCI_CFG_ASYNC_INCLUDED)
    if (SCI_MODE_ASYNC == hdl->mode)
    {
        R_BYTEQ_Close(hdl->u_tx_data.que);
        R_BYTEQ_Close(hdl->u_rx_data.que);
    }
#endif

    /* mark the channel as not in use and power down */
    hdl->mode = SCI_MODE_OFF;
    power_off(hdl->channel);

    return SCI_SUCCESS;
} /* End of function R_SCI_Close() */


/*****************************************************************************
* Function Name: R_SCI_GetVersion
* Description  : Returns the version of this module. The version number is 
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
******************************************************************************/
uint32_t  R_SCI_GetVersion(void)
{
    uint32_t const version = ((uint32_t)SCI_VERSION_MAJOR << 16) | SCI_VERSION_MINOR;

    return version;
} /* End of function R_SCI_GetVersion() */

#ifndef SCI_RYZ014A
#else
static void sci_receive3(sci_hdl_t const hdl)
{
    sci_cb_args_t   args;
    uint8_t         byte;

    /* Read byte */
    byte = RXD3;

#if (SCI_CFG_ASYNC_INCLUDED)
    if (SCI_MODE_ASYNC == hdl->mode)
    {
        /* Place byte in queue */
        if (R_BYTEQ_Put(hdl->u_rx_data.que, byte) == BYTEQ_SUCCESS)
        {
            args.event = SCI_EVT_RX_CHAR;
        }
        else
        {
            args.event = SCI_EVT_RXBUF_OVFL;
        }

#if defined(__CCRL__) || defined(__ICCRL78__)
#if (SCI_CFG_UART3_FLOW_CTRL_ENABLE == 1)
        uint16_t byteq_free = 0;
        R_BYTEQ_Unused(hdl->u_rx_data.que, &byteq_free);
        if (SCI_CFG_UART_RX_BUFFER_THRESH >= byteq_free)
        {
            SCI_CFG_UART3_RTS_PORT = 1;
        }
#endif /* (SCI_CFG_UART3_FLOW_CTRL_ENABLE) */
#endif /* defined__CCRL__ || defined__ICCRL78__ */

#ifndef TOMO
#else
        /* Do callback if available */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = byte;

            /* Casting to void type is valid */
            hdl->callback((void *)&args);
        }
#endif
    }
#endif /* (SCI_CFG_ASYNC_INCLUDED) */
} /* End of function sci_receive() */
#endif

#if (SCI_CFG_ASYNC_INCLUDED)
/*****************************************************************************
* Function Name: sci_receive_async_data
* Description  : This function determines if the rx byte queue of the channel
*                referenced by the handle, the requested number of bytes
*                is available, and get the data from the rx byte queue.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_dst -
*                    ptr to buffer to load data into
*                length -
*                    number of bytes to read
* Return Value : SCI_SUCCESS -
*                    requested number of byte loaded into p_dst
*                SCI_ERR_INSUFFICIENT_DATA -
*                    rx queue does not contain requested amount of data
******************************************************************************/
static sci_err_t sci_receive_async_data3(sci_hdl_t const hdl, uint8_t *p_dst, uint16_t const length)
{
    sci_err_t   err = SCI_SUCCESS;
    uint16_t    cnt;
    byteq_err_t byteq_err = BYTEQ_SUCCESS;

    /* CHECK FOR SUFFICIENT DATA IN QUEUE, AND FETCH IF AVAILABLE */
    R_BYTEQ_Used(hdl->u_rx_data.que, &cnt);

    if (cnt < length)
    {
        return SCI_ERR_INSUFFICIENT_DATA;
    }

    /* Get bytes from rx queue */
    /* WAIT_LOOP */
    for (cnt = 0; cnt < length; cnt++)
    {
        /* Disable RXI Interrupt */
        R_BSP_InterruptsDisable();
        byteq_err = R_BYTEQ_Get(hdl->u_rx_data.que, p_dst++);
        R_BSP_InterruptsEnable();

        if (BYTEQ_SUCCESS != byteq_err)
        {
            err = SCI_ERR_INSUFFICIENT_DATA;
            break;
        }

#if (SCI_CFG_UART3_FLOW_CTRL_ENABLE)
        uint16_t byteq_free;
        R_BYTEQ_Unused(hdl->u_rx_data.que, &byteq_free);
        if (SCI_CFG_UART_RX_BUFFER_THRESH < byteq_free)
        {
            SCI_CFG_UART3_RTS_PORT = 0;
        }
#endif
    }

    return err;
} /* End of function sci_receive_async_data() */

#endif /* SCI_CFG_ASYNC_INCLUDED */
